using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Warehouse_Manager
{
    public partial class Form4 : Form
    {
        public Form4()
        {
            InitializeComponent();

        }

        private void button1_Click(object sender, EventArgs e)
        {
            MessageBox.Show("1. Для додавання нової одиниці товару до бази даних натисніть кнопку 'Додати'" +
                "та заповніть поля, у формі додавання. Зверніть увагу, що поле 'Артикул' є обов'язковим, " +
                "тож перед збереженням перевірте, чи заповнили ви це поле унікальним ідентифікатором товару." +
                "\n2. Для видалення товару натисніть на потрібний рядок, та потім натисніть на кнопку 'Видалити'" +
                "Після видалення рядка необхідно зберегти зміни, інакше при натисканні кнопки 'Оновити'" +
                "видалення буде скасовано." +
                "\n3. Для редагування запису в базі даних, натисніть на потрібний рядок, та відредагуйте поля " +
                "цього рядку за допомогою трьох рядків з правої сторони від таблиці. Переконайтесь, що ви натиснули" +
                " на кнопку 'Зберегти зміни', перед тим, як переходити до виконання інших дій." +
                "\n4. Для пошуку товару у базі даних, введіть артикул, чи назву товару, повну або часткову, в поле" +
                " пошуку. Після цього натисніть на кнопку пошуку, або 'Enter'. Для повернення до повної таблиці, " +
                "натисніть на кнопку 'Оновити', або виконайте пошук з пустим рядком запросу."+
                "\n5. Сортування бази даних за значеннями одного з полів виконується за допомогою натискання " +
                "на заголовок відповідного стовпчика." +
                "\n6. Перемыщення по базі даних також можна здійснювати за допомогою стрілок у верхній лівій " +
                "частині вікна, або за допомогою лічильника записів, що знаходиться між стрілками навігації." +
                "\n Приємного використання!",
                "Information",
                MessageBoxButtons.OK,
                MessageBoxIcon.Information);
        }

        private void button2_Click(object sender, EventArgs e)
        {
            MessageBox.Show("Виконав студент 201 групи" +
                "\n         Мартинов Данило" +
                "\nКурсова робота за 2 семестр з ООП" +
                "\n             2020 рік",
                "\n           Information",
                MessageBoxButtons.OK,
                MessageBoxIcon.Information);
        }

        public void SetAmount(int r)
        {
            label2.Text = r + " од.";
        }

       
    }
}
